Repository: NureKovalenkoVioletta/ark-pzpi-23-3-kovalenko-violetta
Catalog: Lab3/pzpi-23-3-kovalenko-violetta-lab3/FitnessProject/FitnessProject/Resources/Shared.*.resx
Languages: uk

# Recommendations.DietCorrection.Reason.HighActivity
source: High activity
uk: Висока активність

# Recommendations.DietCorrection.Reason.LowActivity
source: Low activity
uk: Низька активність

# Recommendations.DietCorrection.Reason.SleepDeprived
source: Sleep deprivation
uk: Недосип

# Recommendations.DietCorrection.Reason.HeartRateAnomaly
source: Abnormal heart rate
uk: Аномальний пульс

# Recommendations.DietCorrection.Reason.Default
source: Diet correction
uk: Корекція раціону

# Recommendations.DietCorrection.Suggest
source: Suggested adjustment: calories {0} kcal, protein {1} g, fat {2} g, carbs {3} g
uk: Рекомендується скоригувати: калорії {0} ккал, білки {1} г, жири {2} г, вуглеводи {3} г

# Errors.IdMismatch
source: ID mismatch
uk: Невідповідність ID

# Errors.NotFound
source: Not found
uk: Не знайдено

# Errors.BadRequest
source: Bad request
uk: Некоректний запит

# Errors.PayloadEmpty
source: Payload is empty
uk: Порожній запит

# Errors.InvalidPayload
source: Invalid payload
uk: Некоректні дані

# Errors.GeneratedPlanLoadFailed
source: Generated plan could not be loaded
uk: Не вдалося завантажити згенерований план

# Errors.UpdatedPlanLoadFailed
source: Updated plan could not be loaded
uk: Не вдалося завантажити оновлений план

# Errors.RecommendationIdRequired
source: RecommendationId is required
uk: Потрібен RecommendationId

# Telemetry.ReceiveSuccess
source: Telemetry received successfully
uk: Телеметрія отримана успішно

# Telemetry.BatchSuccess
source: Batch of {0} items received successfully
uk: Пакет із {0} записів отримано успішно
